Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes
The dimension types.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.Relative
The point to point dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.Absolute
The dimensions from a common starting point.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.RelativeAndAbsolute
The combination of point to point and a common start point.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.USAbsolute
The dimensions from a common starting point, which includes a running
dimension mark (RD).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.USAbsolute2
The dimensions from a common starting point, which includes a running
dimension mark (RD), but short dimensions are changed to point to
point dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.AbsoluteWithShortRelatives
The dimensions from a common starting point, but short
dimensions are changed to point to point dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.AbsoluteWithAllRelativesAbove
The combination of point to point and a common start point, but
the point to point dimensions are placed above the absolute.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTypes.Elevation
Creates an elevation dimension at a picked point.